example/pitzDaily_drawSystemCurve/constant/pumpCurve_Parameters
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      pumpCurve_Parameters;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

vInletMin       vInletMin [ 0 0 0 0 0 0 0 ] 5;

vInletMax       vInletMax [ 0 0 0 0 0 0 0 ] 25;

interval       interval [ 0 0 0 0 0 0 0 ] 500;

boolSystemCurve       boolSystemCurve [ 0 0 0 0 0 0 0 ] 1;
increment       increment [ 0 0 0 0 0 0 0 ] 1;

tolerance       tolerance [ 0 0 0 0 0 0 0 ] 0.01;

// ************************************************************************* //
