example/pitzDaily_drawSystemCurve/system/totalPressureIncompressible
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates the total pressure field for a case where the solver is
    incompressible (pressure is kinematic, e.g. m^2/s^2).

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/pressure/totalPressureIncompressible.cfg"

pRef    0.0;
rhoInf  1.0;

// ************************************************************************* //
